dot_doom.d/config.el
(setq user-full-name "Paulo Suderio"
      user-mail-address "paulo.suderio@gmail.com")

(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "Noto Sans" :size 13))

(setq doom-theme 'doom-ir-black)

(setq display-line-numbers-type 'relative)

(setq org-directory "~/org/")

(setq doom-modeline-enable-word-count t)
